### 성별, 등석, 나이에 따른 생존율

In [74]:
import pandas as pd
import seaborn

In [75]:
#!pip install seaborn   하면 설치됨

In [76]:
# Data 로딩
df=seaborn.load_dataset('titanic')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

#### 성별

In [77]:
# 성별
df['sex'].isnull().sum()

0

In [78]:
sex_group=df.groupby(by='sex')

In [79]:
# 여자, 남자 중에 살아남은 사람 비율
pd.DataFrame(sex_group.mean()['survived'])

        survived
sex
female  0.742038
male    0.188908

In [119]:
# 살아남은 사람 중에 여자, 남자 비율
pd.DataFrame(sex_group.count()['survived']/df.shape[0])

        survived
sex
female  0.352413
male    0.647587

#### 등석

In [80]:
df['pclass'].isnull().sum()

0

In [81]:
df['pclass'].unique()

array([3, 1, 2], dtype=int64)

In [82]:
pclass_group=df.groupby(by='pclass')

In [136]:
pd.DataFrame(pclass_group.sum()['survived'])

        survived
pclass
1            136
2             87
3            119

In [137]:
pd.DataFrame(pclass_group.sum()['survived']/df.shape[0])

        survived
pclass
1       0.152637
2       0.097643
3       0.133558

#### 나이

In [84]:
df['age'].isnull().sum()

177

In [85]:
# 나이 컬럼의 결측치를 평균으로 채우기
df['age'].fillna(int(df['age'].mean()), inplace=True)

In [86]:
df['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    29.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [87]:
df['age'].min(), df['age'].max()

(0.42, 80.0)

In [88]:
# 소수점 나이는 존재하지 않으므로 int 형태로 변환
df['age']=df['age'].astype('int')

In [89]:
# 제대로 변환 됐는지 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    int32
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(1), int32(1), int64(4), object(5)
memory usage: 77.2+ KB

In [90]:
# 연령대 컬럼을 생성하기 위한 조건
cond1=df['age']<10
cond2=(df['age']>=10)&(df['age']<20)
cond3=(df['age']>=20)&(df['age']<30)
cond4=(df['age']>=30)&(df['age']<40)
cond5=(df['age']>=40)&(df['age']<50)
cond6=(df['age']>=50)&(df['age']<60)
cond7=(df['age']>=60)&(df['age']<70)
cond8=(df['age']>=70)&(df['age']<=80)

In [91]:
# 연령대 컬럼 생성
df.loc[cond1, 'age_group']='0s'
df.loc[cond2, 'age_group']='10s'
df.loc[cond3, 'age_group']='20s'
df.loc[cond4, 'age_group']='30s'
df.loc[cond5, 'age_group']='40s'
df.loc[cond6, 'age_group']='50s'
df.loc[cond7, 'age_group']='60s'
df.loc[cond8, 'age_group']='70s'

In [92]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_group
0,0,3,male,22,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,20s
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,30s
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,20s
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,30s
4,0,3,male,35,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,30s
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,20s
887,1,1,female,19,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,10s
888,0,3,female,29,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,20s
889,1,1,male,26,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,20s
890,0,3,male,32,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,30s

In [93]:
age_group=df.groupby(by='age_group')

In [138]:
pd.DataFrame(age_group.sum()['survived'])

           survived
age_group
0s               38
10s              41
20s             129
30s              73
40s              34
50s              20
60s               6
70s               1

In [128]:
df.groupby('survived').sum()

          pclass    age  sibsp  parch        fare  adult_male  alone
survived
0           1390  16602    304    181  12142.7199         449    374
1            667   9722    162    159  16551.2294          88    163

In [139]:
pd.DataFrame(age_group.sum()['survived'])/df.shape[0]

           survived
age_group
0s         0.042649
10s        0.046016
20s        0.144781
30s        0.081930
40s        0.038159
50s        0.022447
60s        0.006734
70s        0.001122

In [130]:
# 총 생존비율
df.survived.sum()/df.shape[0]

0.3838383838383838

In [135]:
pd.DataFrame(df.groupby(by='pclass').sum()['survived']/df.shape[0])

        survived
pclass
1       0.152637
2       0.097643
3       0.133558

In [148]:
pd.DataFrame(df.groupby(by=['sex', 'pclass', 'age_group','survived']).sum()['fare']/df.shape[0])

                                      fare
sex    pclass age_group survived
female 1      0s        0         0.170090
              10s       1         1.569056
              20s       0         0.170090
                        1         2.990011
              30s       1         3.277170
...                                    ...
male   3      40s       0         0.246100
                        1         0.017929
              50s       0         0.051857
              60s       0         0.015699
              70s       0         0.017424

[70 rows x 1 columns]